app/controllers/ideas_controller.rb

def create


 @idea = Idea.new(idea_params)

    respond_to do |format|


if @idea.save
---
INSERT INTO "ideas" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "vacio"], ["description", "sin foto"], ["created_at", "2020-06-01 23:27:18.977968"], ["updated_at", "2020-06-01 23:27:18.977968"]]

 def update
    respond_to do |format|


 if @idea.update(idea_params)
---
UPDATE "ideas" SET "description" = ?, "updated_at" = ? WHERE "ideas"."id" = ?  [["description", "Que tal"], ["updated_at", "2020-06-01 01:04:38.940179"], ["id", 11]]